InformationRegisters/КорректныеКорреспонденцииСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>КорректныеКорреспонденцииСчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/КорреспонденцииСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>КорреспонденцииСчетов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетКт</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Типовой</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперацииДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗакладкаДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МоментИспользования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Меню</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/КорректныеКорреспонденцииСчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
Процедура ЗаполнитьКорреспонденциюПроводок() Экспорт
	
	МакетСчетов = Справочники.КорреспонденцииСчетов.ПолучитьМакет("Макет");
	НомерСтроки = 1;
			
	Пока Истина Цикл
		
		Номер = МакетСчетов.Область(НомерСтроки,1).Текст;
		Если НЕ ЗначениеЗаполнено(Номер) Тогда			
			Прервать;
		КонецЕсли;
		
		СчетДт = ПланыСчетов.Типовой.НайтиПоКоду(МакетСчетов.область(НомерСтроки,3).Текст);
		СчетКт = ПланыСчетов.Типовой.НайтиПоКоду(МакетСчетов.область(НомерСтроки,4).Текст);
		
		ЗаписьКорреспонденцииСчетов = РегистрыСведений.КорректныеКорреспонденцииСчетов.СоздатьМенеджерЗаписи();		
		ЗаписьКорреспонденцииСчетов.СчетДт = СчетДт;
		ЗаписьКорреспонденцииСчетов.СчетКт = СчетКт;                                                           		
		ЗаписьКорреспонденцииСчетов.Прочитать();		
		
		ЗаписьСуществует = ЗаписьКорреспонденцииСчетов.Выбран();
		
		Если Не ЗаписьСуществует Тогда		
			ЗаписьКорреспонденцииСчетов.СчетДт = СчетДт;
			ЗаписьКорреспонденцииСчетов.СчетКт = СчетКт;
			ЗаписьКорреспонденцииСчетов.Комментарий 		  = МакетСчетов.Область(НомерСтроки,2).Текст;
			
			ЗаписьКорреспонденцииСчетов.Записать(Истина);
		КонецЕсли;	
		
		НомерСтроки = НомерСтроки+1;
		
	КонецЦикла;  
	
КонецПроцедуры

#КонецЕсли
